# IdeaStatiCa.ConnectionApi.Model.ConWeldData

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Kind** | **ConWeldDataKind** |  | [optional]
**Size** | **double** |  | [optional]
**Type** | **ConWeldType** |  | [optional]
**MaterialId** | **int?** |  | [optional]
**BeginOffset** | **double** |  | [optional]
**EndOffset** | **double** |  | [optional]
**Length** | **double** |  | [optional]
**Gap** | **double** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)